'use strict';

//* Массивы и псевдомассивы

const arr = [10, 6, 3, 15, 7, 9];


////////! Правильная сортировка цифр в методе sort();
  console.log(arr.sort((a, b) => a - b));
////////!

// Удаляет послдений элемент из массива

// Добавляет элемент в конец массива


//* Переборы массива
// Циклом


// Перебор через метод «for of» работает только с массиво подобными сущностями


// Перебор массива с помощью метода «forEach»
// Колбэк функция прнимает три аргумента
// 1. сам элемента с произвольнм названием 
// 2. номер элемента по порядку в массиве
// 3. ссылка на массив который мы перебираем
