'use strict';

//* ClassList и делегирование событий


//* Получение количество классов у элемента

//* Узнаем индекс класса у элемента

//* Добавление/Удаление определенного класса

//* Переключение классов
//! Если класс есть убирает если класса нет добавляет

//* Определяет содержит ли элемент определенный класс

//! Не удобный способ но он есть
//* Получение всех классов в ввиде одной строки

//* Preview

//* Делегирование событий

//* Делегирование через tagName элемента

//* Делегирование Google

//! Перебор не работает на динамические элементы