'use strict';

//* Передача по ссылке или значению / «Spread - оператор» *//




//* 1. Клонирование обекта только первого уровня с помощью цикла «for in»
// Поверхностная копия объекта


//* 2. Объединение двух объектов «Object.assign()»
//  Получение независомой поверхостной копии объекта

//*  Поверхостная копия массива методом «slice()»


// Передача массива ввиде аргументов с помощью «Spread» -> «Oператор Разварота ... »


//! С помощью Spread оператора перада аргументов в функцию по отдельности не массивом


// Поверхностная копия при помощи Spread оператора
