'use strict';

//* Параметры документа окна и работа с ними



//* Получение размеров всего окная -15px прокукрутки и рамки снизу

//* Получение размеров окна как указаных в стилях вся видимая часть 

//* Получение размеров контента что не помещаеться в видимую часть -15px прокрутка

// При клике открываеться весь скрытый тексл за скролом

// Получение всех координат окна методом «getBoundingClientRect»

// Получение информацию какие стили приенены к опр. элементу «Cumputed»

// Узнаем размер видимой части окна браузера



// //* Премещение относительно того места на котором остановились (x, y)

// //* Премещение с начала страницы (x, y)