'use strict';

//* Objects, деструктуризация объектов

//! Вариант возможен, но не используеться
// const obj = new Object(); 

//* Созданный метод объекта

//! Созданный метод объекта

// Перебор объекта поверхностных свойств

//* Деструктуризация объекта


//* Узнаем сколько свойств у объекта / без вложенных
//! Старый и не удобный метод подсчета свойств в объекте

//! Удаление свойства объекта при помощи «delete»

//! Перебор вложенных объектов «for (let item in object)»
//* Встроенный метод 
//* Делаем из свойств объекта массив «Object.keys()»

//* Делаем подсчет массива свойством «length»
