'use strict';

//* Objects, деструктуризация объектов

// const obj = new Object(); //! Вариант возможен, но не используеться

//* Созданный метод объекта


//* Деструктуризация объекта


//* Метод //* Делаем из свойств объекта массив «Object.keys()»


//* Делаем подсчет массива свойством «length»


//! Удаление свойства объекта при помощи «delete»


//! Перебор вложенных объектов «for (let item in object)»


//* Узнаем сколько свойств у объекта
//! Старый и не удобный метод подсчета свойств в объекте








